app/controllers/adresses_controller.rb

SELECT `adresses`.* FROM `adresses`
---
  def index
    @adresses = Adress.all

INSERT INTO `adresses` (`street`, `district`, `number`, `state`, `city`, `created_at`, `updated_at`) VALUES ('iuhiuh', 'uhiuhiuh', 968554, 'ohiuh', 'ohjoi', '2016-02-27 14:25:32', '2016-02-27 14:25:32')
---
  def create
    @adress = Adress.new(adress_params)

    respond_to do |format|
      if @adress.save

SELECT  `adresses`.* FROM `adresses` WHERE `adresses`.`id` = 1 LIMIT 1
---
    def set_adress
      @adress = Adress.find(params[:id])