app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT `clients`.* FROM `clients`

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO `clients` (`name`, `phone`, `email`, `cpf`, `salario`, `RG`, `adress_id`, `created_at`, `updated_at`) VALUES ('Luan Zanchet', '4999009900', 'luan@luan.com', '08888888745', 1000.0, '888888', 1, '2016-02-27 21:24:35', '2016-02-27 21:24:35')

    def set_client
      @client = Client.find(params[:id])
---
SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1