app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `quantity`, `price`, `supplier_id`, `created_at`, `updated_at`) VALUES ('carne', 5.0, 50.0, 1, '2016-02-27 14:25:53', '2016-02-27 14:25:53')