app/controllers/suppliers_controller.rb

SELECT `suppliers`.* FROM `suppliers`
---
  def index
    @suppliers = Supplier.all

INSERT INTO `suppliers` (`name`, `cpnj`, `phone`, `adress_id`, `created_at`, `updated_at`) VALUES ('serrano', '0878887878', '34350000', 0, '2016-02-27 14:24:12', '2016-02-27 14:24:12')
---
  def create
    @supplier = Supplier.new(supplier_params)

    respond_to do |format|
      if @supplier.save

SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 2 LIMIT 1
---
    def set_supplier
      @supplier = Supplier.find(params[:id])